{
  "model_type": "llama",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "vocab_size": 32000,
  "hidden_size": 4096,
  "intermediate_size": 11008,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "hidden_act": "silu",
  "max_position_embeddings": 2048,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "rope_theta": 10000.0,
  "torch_dtype": "float16",
  "transformers_version": "4.36.0",
  "executor_torch_optimized": true,
  "qualcomm_npu_ready": true,
  "qnn_backend": "htp",
  "compilation_notes": "This model follows ExecutorTorch Qualcomm patterns for mobile NPU acceleration"
}